var locations = [
    {key:'北京',val:[{name:'延庆县',sub:[]},{name:'密云县',sub:[]}]},
    {key:'上海',val:[]},
    {key:'天津',val:[]},
    {key:'重庆',val:[{name:'丰都县',sub:[]},{name:'忠县',sub:[]},{name:'云阳县',sub:[]},{name:'奉节县',sub:[]},{name:'潼南县',sub:[]},{name:'巫山县',sub:[]},{name:'巫溪县',sub:[]},{name:'垫江县',sub:[]},{name:'城口县',sub:[]},{name:'石柱土家族自治县',sub:[]},{name:'秀山土家族苗族自治县',sub:[]},{name:'酉阳土家族苗族自治县',sub:[]},{name:'彭水苗族土家族自治县',sub:[]}]},
    {key:'河北省',val:[
        {name:'石家庄市',sub:['井陉县','正定县','栾城县','行唐县','灵寿县','高邑县','深泽县','赞皇县','无极县','平山县','元氏县','赵县']}
        ,{name:'唐山市',sub:['滦县','滦南县','乐亭县','迁西县','玉田县','唐海县']}
        ,{name:'秦皇岛市',sub:['昌黎县','抚宁县','卢龙县','青龙满族自治县']}
        ,{name:'邯郸市',sub:['邯郸县','临漳县','成安县','大名县','涉县','磁县','肥乡县','永年县','邱县','鸡泽县','广平县','馆陶县','魏县','曲周县']}
        ,{name:'邢台市',sub:['邢台县','临城县','内丘县','柏乡县','隆尧县','任县','南和县','宁晋县','巨鹿县','新河县','广宗县','平乡县威县','清河县','临西县']}
        ,{name:'保定市',sub:['满城县','清苑县','涞水县','阜平县','徐水县','定兴县','唐县','高阳县','容城县','涞源县','望都县','安新县','易县','曲阳县','蠡县','顺平县','博野县','雄县']}
        ,{name:'张家口市',sub:['张北县','康保县','沽源县','尚义县','蔚县','阳原县','怀安县','万全区','怀来县','涿鹿县','赤城县','崇礼县']}
        ,{name:'承德市',sub:['承德县','兴隆县','平泉县','滦平县','隆化县','丰宁满族自治县','宽城满族自治县','围场满族蒙古族自治县']}
        ,{name:'沧州市',sub:['沧县','青县','东光县','海兴县','盐山县','肃宁县','南皮县','吴桥县','献县','孟村回族自治县']}
        ,{name:'廊坊市',sub:['固安县','永清县','香河县','大城县','文安县','大厂回族自治县']}
        ,{name:'衡水市',sub:['枣强县','武邑县','武强县','饶阳县安平县','故城县','景县','阜城县']}
    ]
    },
    {key:'山西省',val:[
        {name:'太原市',sub:['阳曲县','清徐县','娄烦县']}
        ,{name:'大同市',sub:['大同县','天镇县','灵丘县','阳高县','左云县','广灵县','浑源县']}
        ,{name:'阳泉市',sub:['平定县','盂县']}
        ,{name:'长治市',sub:['潞城市','长治县','长子县','平顺县','襄垣县','沁源县','屯留县','黎城县','武乡县','沁县','壶关县']}
        ,{name:'晋城市',sub:['高平市','泽州县','陵川县','阳城县','沁水县']}
            ,{name:'朔州市',sub:['山阴县','右玉县','应县','怀仁县']}
            ,{name:'晋中市',sub:['介休市','昔阳县','灵石县','祁县','左权县','寿阳县','太谷县','和顺县','平遥县','榆社县']}
            ,{name:'运城市',sub:['河津市','永济市','闻喜县','新绛县','平陆县','垣曲县','绛县','稷山县','芮城县','夏县','万荣县','临猗县']}
            ,{name:'忻州市',sub:['原平市','代县','神池县','五寨县','五台县','偏关县','宁武县','静乐县','繁峙县','河曲县','保德县','定襄县','岢岚县']}
            ,{name:'临汾市',sub:['侯马市','霍州市','汾西县','吉县','安泽县','大宁县','浮山县','古县','隰县','襄汾县','翼城县','永和县','乡宁县','曲沃县','洪洞县','蒲县']}
            ,{name:'吕梁市',sub:['孝义市','汾阳市','文水县','中阳县','兴县','临县','方山县','柳林县','岚县','交口县','交城县','石楼县']}
        ]},
        {key:'内蒙古自治区',val:[
            {name:'呼和浩特市',sub:['托克托县','武川县','清水河县','和林格尔县']}
            ,{name:'包头市',sub:['固阳县']}
            ,{name:'乌海市',sub:[]}
            ,{name:'赤峰市',sub:['林西县','宁城县']}
            ,{name:'通辽市',sub:['开鲁县']}
            ,{name:'鄂尔多斯市',sub:[]}
            ,{name:'呼伦贝尔市',sub:['满洲里市','牙克石市','扎兰屯市','额尔古纳市','根河市']}
            ,{name:'巴彦淖尔市',sub:['五原县','磴口县']}
            ,{name:'乌兰察布市',sub:['卓资县','化德县','商都县','兴和县','凉城县','丰镇市']}
            ,{name:'兴安盟',sub:['突泉县','乌兰浩特市','阿尔山市']}
            ,{name:'锡林郭勒盟',sub:['多伦县']}
            ,{name:'阿拉善盟',sub:[]}
        ]
        },{
            key:'黑龙江省'
            ,val:[
                {name:'哈尔滨市',sub:['五常市','依兰县','方正县','宾县','巴彦县','木兰县','通河县','延寿县']}
                ,{name:'齐齐哈尔市',sub:['讷河市','龙江县','依安县','泰来县','甘南县','富裕县','克山县','克东县','拜泉县']}
                ,{name:'牡丹江市',sub:['绥芬河市','海林市','宁安市','穆棱市','东宁县','林口县']}
                ,{name:'佳木斯市',sub:['同江市','富锦市','桦南县','桦川县','汤原县','抚远县']}
                ,{name:'大庆市',sub:['肇州县','肇源县','林甸县','杜尔伯特蒙古族自治县']}
                ,{name:'鸡西市',sub:['虎林市','密山市','鸡东县']}
                ,{name:'双鸭山市',sub:['集贤县','友谊县','宝清县','饶河县']}
                ,{name:'伊春市',sub:['铁力市','嘉荫县']}
                ,{name:'七台河市',sub:['勃利县']}
                ,{name:'黑河市',sub:['北安市','嫩江县','逊克县','孙吴县']}
                ,{name:'绥化市',sub:['海伦市','望奎县','兰西县','青冈县','庆安县','明水县','绥棱县']}
                ,{name:'大兴安岭地区',sub:['呼玛县','塔河县','漠河县']}
            ]
        },
        {
            key:'吉林省'
            ,val:[
            {name:'长春市',sub:['德惠市','九台市','榆树市','农安县']},
            {name:'吉林市',sub:['蛟河市','桦甸市','舒兰市','磐石市','永吉县']},
            {name:'四平市',sub:['公主岭市','双辽市','梨树县','伊通满族自治县']},
            {name:'辽源市',sub:['东丰县','东辽县']},
            {name:'通化市',sub:['集安市','通化县','辉南县','柳河县']},
            {name:'白山市',sub:['临江市','抚松县','靖宇县','长白朝鲜族自治县']},
            {name:'松原市',sub:['长岭县','乾安县','扶余县','前郭尔罗斯蒙古族自治县']},
            {name:'白城市',sub:['洮南市','大安市','镇赉县','通榆县']},
            {name:'延边朝鲜族自治州',sub:['延吉市','图们市','敦化市','珲春市','龙井市','和龙市','汪清县','安图县']}
        ]
        },{
            key: '辽宁省',
            val: [{
                name: '沈阳市',
                sub: ['新民市', '辽中县', '康平县', '法库县']
            }, {
                name: '大连市',
                sub: ['瓦房店市', '普兰店市', '庄河市', '长海县']
            }, {
                name: '鞍山市',
                sub: ['海城市', '台安县', '岫岩满族自治县']
            }, {
                name: '抚顺市',
                sub: ['抚顺县', '新宾满族自治县', '清原满族自治县']
            }, {
                name: '本溪市',
                sub: ['本溪满族自治县', '桓仁满族自治县']
            }, {
                name: '丹东市',
                sub: ['东港市', '凤城市', '宽甸满族自治县']
            }, {
                name: '锦州市',
                sub: ['凌海市', '北镇市', '黑山县', '义县']
            }, {
                name: '营口市',
                sub: ['盖州市', '大石桥市']
            }, {
                name: '阜新市',
                sub: ['阜新蒙古族自治县', '彰武县']
            }, {
                name: '辽阳市',
                sub: ['灯塔市', '辽阳县']
            }, {
                name: '盘锦市',
                sub: ['盘山县']
            }, {
                name: '铁岭市',
                sub: ['调兵山市', '开原市', '铁岭县', '西丰县', '昌图县']
            }, {
                name: '朝阳市',
                sub: ['北票市', '凌源市', '朝阳县', '建平县', '喀喇沁左翼蒙古族自治县']
            }, {
                name: '葫芦岛市',
                sub: ['兴城市', '绥中县', '建昌县']
            }]
        }, {
            key: '山东省',
            val: [{
                name: '济南市',
                sub: ['章丘市', '平阴县', '济阳县', '商河县']
            }, {
                name: '青岛市',
                sub: ['胶州市', '即墨市', '平度市', '胶南市', '莱西市']
            }, {
                name: '淄博市',
                sub: ['桓台县', '高青县', '沂源县']
            }, {
                name: '枣庄市',
                sub: ['滕州市']
            }, {
                name: '东营市',
                sub: ['垦利县', '利津县', '广饶县']
            }, {
                name: '烟台市',
                sub: ['龙口市', '莱阳市', '莱州市', '蓬莱市', '招远市', '栖霞市', '海阳市', '长岛县']
            }, {
                name: '潍坊市',
                sub: ['青州市', '诸城市', '寿光市', '安丘市', '高密市', '昌邑市', '临朐县', '昌乐县']
            }, {
                name: '威海市',
                sub: ['文登市', '荣成市', '乳山市']
            }, {
                name: '济宁市',
                sub: ['曲阜市', '兖州市', '邹城市', '微山县', '鱼台县', '金乡县', '嘉祥县', '汶上县', '泗水县', '梁山县']
            }, {
                name: '泰安市',
                sub: ['新泰市', '肥城市', '宁阳县', '东平县']
            }, {
                name: '日照市',
                sub: ['五莲县', '莒县']
            }, {
                name: '莱芜市',
                sub: []
            }, {
                name: '临沂市',
                sub: ['沂南县', '郯城县', '沂水县', '苍山县', '费县', '平邑县', '莒南县', '蒙阴县', '临沭县']
            }, {
                name: '德州市',
                sub: ['乐陵市', '禹城市', '陵县', '宁津县', '庆云县', '临邑县', '齐河县', '平原县', '夏津县', '武城县']
            }, {
                name: '聊城市',
                sub: ['临清市', '阳谷县', '莘县', '茌平县', '东阿县', '冠县', '高唐县']
            }, {
                name: '滨州市',
                sub: ['惠民县', '阳信县', '无棣县', '沾化县', '博兴县', '邹平县']
            }, {
                name: '菏泽市',
                sub: ['曹县', '单县', '成武县', '巨野县', '郓城县', '鄄城县', '定陶县', '东明县']
            }]
        },{
            key: '浙江省',
            val: [{
                name: '杭州市',
                sub: ['建德市', '富阳市', '临安市', '桐庐县', '淳安县']
            }, {
                name: '宁波市',
                sub: ['余姚市', '慈溪市', '奉化市', '象山县', '宁海县']
            }, {
                name: '温州市',
                sub: ['瑞安市', '乐清市', '洞头县', '永嘉县', '平阳县', '苍南县', '文成县', '泰顺县']
            }, {
                name: '嘉兴市',
                sub: ['海宁市', '平湖市', '桐乡市', '嘉善县', '海盐县']
            }, {
                name: '湖州市',
                sub: ['德清县', '长兴县', '安吉县']
            }, {
                name: '绍兴市',
                sub: ['诸暨市', '上虞市', '嵊州市', '绍兴县', '新昌县']
            }, {
                name: '金华市',
                sub: ['兰溪市', '义乌市', '东阳市', '永康市', '武义县', '浦江县', '磐安县']
            }, {
                name: '衢州市',
                sub: ['江山市', '常山县', '开化县', '龙游县']
            }, {
                name: '舟山市',
                sub: ['岱山县', '嵊泗县']
            }, {
                name: '台州市',
                sub: ['温岭市', '临海市', '玉环县', '三门县', '天台县', '仙居县']
            }, {
                name: '丽水市',
                sub: ['龙泉市', '青田县', '缙云县', '遂昌县', '松阳县', '云和县', '庆元县', '景宁畲族自治县']
            }]
        }, {
            key: '安徽省',
            val: [{
                name: '合肥市',
                sub: ['长丰县', '肥东县', '肥西县']
            }, {
                name: '芜湖市',
                sub: ['芜湖县', '繁昌县', '南陵县']
            }, {
                name: '蚌埠市',
                sub: ['怀远县', '五河县', '固镇县']
            }, {
                name: '淮南市',
                sub: ['凤台县']
            }, {
                name: '马鞍山市',
                sub: ['当涂县']
            }, {
                name: '淮北市',
                sub: ['濉溪县']
            }, {
                name: '铜陵市',
                sub: ['铜陵县']
            }, {
                name: '安庆市',
                sub: ['桐城市', '怀宁县', '枞阳县', '潜山县', '太湖县', '宿松县', '望江县', '岳西县']
            }, {
                name: '黄山市',
                sub: ['歙县', '休宁县', '黟县', '祁门县']
            }, {
                name: '滁州市',
                sub: ['天长市', '明光市', '来安县', '全椒县', '定远县', '凤阳县']
            }, {
                name: '阜阳市',
                sub: ['界首市', '临泉县', '太和县', '阜南县', '颍上县']
            }, {
                name: '宿州市',
                sub: ['砀山县', '萧县', '灵璧县', '泗县']
            }, {
                name: '巢湖市',
                sub: ['庐江县', '无为县', '含山县', '和县']
            }, {
                name: '六安市',
                sub: ['寿县', '霍邱县', '舒城县', '金寨县', '霍山县']
            }, {
                name: '亳州市',
                sub: ['涡阳县', '蒙城县', '利辛县']
            }, {
                name: '池州市',
                sub: ['东至县', '石台县', '青阳县']
            }, {
                name: '宣城市',
                sub: ['宁国市', '郎溪县', '广德县', '泾县', '绩溪县', '旌德县']
            }]
        }, {
            key: '江西省',
            val: [{
                name: '南昌市',
                sub: ['南昌县', '新建县', '安义县', '进贤县']
            }, {
                name: '景德镇市',
                sub: ['乐平市', '浮梁县']
            }, {
                name: '萍乡市',
                sub: ['莲花县', '芦溪县', '上栗县']
            }, {
                name: '九江市',
                sub: ['庐山市', '瑞昌市', '九江县', '武宁县', '修水县', '永修县', '德安县', '都昌县', '湖口县', '彭泽县']
            }, {
                name: '新余市',
                sub: ['分宜县']
            }, {
                name: '鹰潭市',
                sub: ['贵溪市', '余江县']
            }, {
                name: '赣州市',
                sub: ['瑞金市', '南康市', '信丰县', '大余县', '上犹县', '崇义县', '安远县', '龙南县', '定南县', '全南县', '宁都县', '于都县', '兴国县', '会昌县', '寻乌县', '石城县']
            }, {
                name: '吉安市',
                sub: ['井冈山市', '吉安县', '吉水县', '峡江县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县']
            }, {
                name: '宜春市',
                sub: ['丰城市', '樟树市', '高安市', '奉新县', '万载县', '上高市', '宜丰县', '靖安县', '铜鼓县']
            }, {
                name: '抚州市',
                sub: ['南城县', '黎川县', '南丰县', '崇仁县', '乐安县', '宜黄县', '金溪县', '资溪县', '东乡县', '广昌县']
            }, {
                name: '上饶市',
                sub: ['德兴市', '上饶县', '广丰县', '玉山县', '铅山县', '横峰县', '弋阳县', '余干县', '鄱阳县', '万年县', '婺源县']
            }]
        },{
            key: '河南省',
            val: [{
                name: '郑州市',
                sub: ['巩义市', '荥阳市', '新密市', '新郑市', '登封市', '中牟县']
            }, {
                name: '开封市',
                sub: ['杞县', '通许县', '尉氏县', '开封县', '兰考县']
            }, {
                name: '洛阳市',
                sub: ['偃师市', '孟津县', '新安县', '栾川县', '嵩县', '汝阳县', '宜阳县', '洛宁县', '伊川县']
            }, {
                name: '平顶山市',
                sub: ['舞钢市', '汝州市', '宝丰县', '叶县', '鲁山县', '郏县']
            }, {
                name: '焦作市',
                sub: ['沁阳市', '孟州市', '修武县', '博爱县', '武陟县', '温县']
            }, {
                name: '鹤璧市',
                sub: ['浚县', '淇县']
            }, {
                name: '新乡市',
                sub: ['卫辉市', '辉县市', '新乡县', '获嘉县', '原阳县', '延津县', '封丘县', '长垣县']
            }, {
                name: '安阳市',
                sub: ['林州市', '安阳县', '汤阴县', '滑县', '内黄县']
            }, {
                name: '濮阳市',
                sub: ['清丰县', '南乐县', '范县', '台前县', '濮阳县']
            }, {
                name: '许昌市',
                sub: ['禹州市', '长葛市', '许昌县', '鄢陵县', '襄城县']
            }, {
                name: '漯河市',
                sub: ['舞阳县', '临颍县']
            }, {
                name: '三门峡市',
                sub: ['义马市', '灵宝市', '渑池县', '陕县', '卢氏县']
            }, {
                name: '南阳市',
                sub: ['邓州市', '南召县', '方城县', '西峡县', '镇平县', '内乡县', '淅川县', '社旗县', '唐河县', '新野县', '桐柏县']
            }, {
                name: '商丘市',
                sub: ['永城市', '民权县', '睢县', '宁陵县', '柘城县', '虞城县', '夏邑县']
            }, {
                name: '信阳市',
                sub: ['罗山县', '光山县', '新县', '商城县', '固始县', '潢川县', '淮滨县', '息县']
            }, {
                name: '周口市',
                sub: ['项城市', '扶沟县', '西华县', '商水县', '沈丘县', '郸城县', '淮阳县', '太康县', '鹿邑县']
            }, {
                name: '驻马店市',
                sub: ['西平县', '上蔡县', '平舆县', '正阳县', '确山县', '泌阳县', '汝南县', '遂平县', '新蔡县']
            }]
        }, {
            key: '湖北省',
            val: [{
                name: '武汉市',
                sub: []
            },{
                name: '仙桃市',
                sub: []
            },{
                name: '潜江市',
                sub: []
            },{
                name: '天门市',
                sub: []
            }, {
                name: '黄石市',
                sub: ['大冶市', '阳新县']
            }, {
                name: '襄樊市',
                sub: ['老河口市', '枣阳市', '宜城市', '南漳县', '谷城县', '保康县']
            }, {
                name: '十堰市',
                sub: ['丹江口市', '郧县', '郧西县', '竹山县', '竹溪县', '房县']
            }, {
                name: '荆州市',
                sub: ['石首市', '洪湖市', '松滋市', '公安县', '监利县', '江陵县']
            }, {
                name: '宜昌市',
                sub: ['宜都市', '当阳市', '枝江市', '远安县', '兴山县', '秭归县', '长阳土家族自治县', '五峰土家族自治县']
            }, {
                name: '荆门市',
                sub: ['钟祥市', '京山县', '沙洋县']
            }, {
                name: '鄂州市',
                sub: []
            }, {
                name: '孝感市',
                sub: ['应城市', '安陆市', '汉川市', '孝昌县', '大悟县', '云梦县']
            }, {
                name: '黄冈市',
                sub: ['麻城市', '武穴市', '团风县', '红安县', '罗田县', '英山县', '浠水县', '蕲春县', '黄梅县']
            }, {
                name: '咸宁市',
                sub: ['赤壁市', '嘉鱼县', '通城县', '崇阳县', '通山县']
            }, {
                name: '随州市',
                sub: ['广水市']
            }, {
                name: '恩施土家族苗族自治州',
                sub: ['恩施市', '利川市', '建始县', '巴东县', '宣恩县', '咸丰县', '来凤县', '鹤峰县']
            }]
        },{
            key: '湖南省',
            val: [{
                name: '长沙市',
                sub: ['浏阳市', '长沙县', '望城县', '宁乡县']
            }, {
                name: '株洲市',
                sub: ['醴陵市', '株洲县', '茶陵县', '炎陵县']
            }, {
                name: '湘潭市',
                sub: ['湘乡市', '韶山市', '湘潭县']
            }, {
                name: '衡阳市',
                sub: ['耒阳市', '常宁市', '衡阳县', '衡南县衡山县', '衡东县', '祁东县']
            }, {
                name: '邵阳市',
                sub: ['武冈市', '邵东县', '新邵县', '邵阳县', '隆回县', '洞口县', '绥宁县', '新宁县', '城步自治县']
            }, {
                name: '岳阳市',
                sub: ['汨罗市', '临湘市', '岳阳县', '华容县', '湘阴县', '平江县']
            }, {
                name: '常德市',
                sub: ['津市市', '安乡县', '汉寿县', '澧县', '临澧县', '桃源县', '石门县']
            }, {
                name: '张家界市',
                sub: ['慈利县', '桑植县']
            }, {
                name: '益阳市',
                sub: ['沅江市', '南县', '桃江县', '安化县']
            }, {
                name: '郴州市',
                sub: ['资兴市', '桂阳县', '宜章县', '永兴县', '嘉禾县', '临武县', '汝城县', '桂东县', '安仁县']
            }, {
                name: '永州市',
                sub: ['祁阳县', '东安县', '双牌县', '道县', '江永县', '宁远县', '蓝山县', '新田县', '江华瑶族自治县']
            }, {
                name: '怀化市',
                sub: ['洪江市', '沅陵县', '辰溪县', '溆浦县', '中方县', '会同县', '麻阳苗族自治县', '新晃侗族自治县', '芷江侗族自治县', '靖州苗族侗族自治县', '通道侗族自治县']
            }, {
                name: '娄底市',
                sub: ['冷水江市', '涟源市', '双峰县', '新化县']
            }, {
                name: '湘西土家族苗族自治州',
                sub: ['吉首市', '泸溪县', '凤凰县', '花垣县', '保靖县', '古丈县', '永顺县']
            }]
        },{
            key: '广东省',
            val: [{
                name: '广州市',
                sub: ['增城市', '从化市']
            }, {
                name: '深圳市',
                sub: []
            }, {
                name: '珠海市',
                sub: []
            }, {
                name: '汕头市',
                sub: ['南澳县']
            }, {
                name: '韶关市',
                sub: ['乐昌市', '南雄市', '始兴县', '仁化县', '翁源县', '新丰县', '乳源瑶族自治县']
            }, {
                name: '佛山市',
                sub: []
            }, {
                name: '江门市',
                sub: ['台山市', '开平市', '鹤山市', '恩平市']
            }, {
                name: '湛江市',
                sub: ['廉江市', '雷州市', '吴川市', '遂溪县', '徐闻县']
            }, {
                name: '茂名市',
                sub: ['高州市', '化州市', '信宜市', '电白县']
            }, {
                name: '肇庆市',
                sub: ['高要市', '四会市', '广宁县', '怀集县', '封开县', '德庆县']
            }, {
                name: '惠州市',
                sub: ['博罗县', '惠东县', '龙门县']
            }, {
                name: '梅州市',
                sub: ['兴宁市', '大埔县', '丰顺县', '五华县', '平远县', '蕉岭县']
            }, {
                name: '汕尾市',
                sub: ['陆丰市', '海丰县', '陆河县']
            }, {
                name: '河源市',
                sub: ['紫金县', '龙川县', '连平县', '和平县', '东源县']
            }, {
                name: '阳江市',
                sub: ['阳春市', '阳西县', '阳东县']
            }, {
                name: '清远市',
                sub: ['英德市', '连州市', '佛冈县', '阳山县', '清新县', '连山壮族瑶族自治县', '连南瑶族自治县']
            }, {
                name: '东莞市',
                sub: []
            }, {
                name: '中山市',
                sub: []
            }, {
                name: '潮州市',
                sub: ['潮安县', '饶平县']
            }, {
                name: '揭阳市',
                sub: ['普宁市', '揭东县', '揭西县', '惠来县']
            }, {
                name: '云浮市',
                sub: ['罗定市', '新兴县', '郁南县', '云安县']
            }]
        },{
            key: '广西壮族自治区',
            val: [{
                name: '南宁市',
                sub: ['武鸣县', '隆安县', '马山县', '上林县', '宾阳县', '横县']
            }, {
                name: '柳州市',
                sub: ['柳城县', '鹿寨县', '融安县', '融水苗族自治县', '三江侗族自治县']
            }, {
                name: '桂林市',
                sub: ['阳朔县', '临桂县', '灵川县', '全州县', '兴安县', '永福县', '灌阳县', '资源县', '平乐县', '荔浦县', '龙胜各族自治县', '恭城瑶族自治县']
            }, {
                name: '梧州市',
                sub: ['苍梧县', '藤县', '蒙山县', '岑溪市']
            }, {
                name: '北海市',
                sub: ['合浦县']
            }, {
                name: '防城港市',
                sub: ['上思县', '东兴市']
            }, {
                name: '崇左市',
                sub: ['扶绥县', '宁明县', '龙州县', '大新县', '天等县', '凭祥市']
            }, {
                name: '钦州市',
                sub: ['灵山县', '浦北县']
            }, {
                name: '贵港市',
                sub: ['平南县', '桂平市']
            }, {
                name: '玉林市',
                sub: ['容县', '陆川县', '博白县', '兴业县', '北流市']
            }, {
                name: '百色市',
                sub: ['田阳县', '田东县', '平果县', '德保县', '靖西县', '那坡县', '凌云县', '乐业县', '田林县', '西林县', '隆林各族自治县']
            }, {
                name: '贺州市',
                sub: ['昭平县', '钟山县', '富川瑶族自治县']
            }, {
                name: '河池市',
                sub: ['宜州市', '南丹县', '天峨县', '凤山县', '东兰县', '罗城仫佬族自治县', '环江毛南族自治县', '巴马瑶族自治县', '都安瑶族自治县', '大化瑶族自治县']
            }, {
                name: '来宾市',
                sub: ['合山市', '忻城县', '象州县', '武宣县', '金秀瑶族自治县']
            }]
        },{
            key: '海南省',
            val: [{
                sub: [],
                name: '海口市'
            },{
                sub: [],
                name: '三亚市'
            },{
                name: '琼海市',
                sub: []
            },{
                name: '文昌市',
                sub: []
            },{
                name: '万宁市',
                sub: []
            },{
                name: '五指山市',
                sub: []
            },{
                name: '东方市',
                sub: []
            },{
                name: '儋州市',
                sub: []
            },{
                name: '临高县',
                sub: []
            },{
                name: '澄迈县',
                sub: []
            },{
                name: '定安县',
                sub: []
            },{
                name: '屯昌县',
                sub: []
            },{
                name: '昌江黎族自治县',
                sub: []
            },{
                name: '白沙黎族自治县',
                sub: []
            },{
                name: '琼中黎族苗族自治县',
                sub: []
            },{
                name: '陵水黎族自治县',
                sub: []
            },{
                name: '保亭黎族苗族自治县',
                sub: []
            },{
                name: '乐东黎族自治县',
                sub: []
            }]
        },{
            key: '台湾省',
            val: [{
                name: '台北市',
                sub: []
            }, {
                name: '高雄市',
                sub: []
            }, {
                name: '基隆市',
                sub: []
            }, {
                name: '台中市',
                sub: []
            }, {
                name: '新竹市',
                sub: []
            }, {
                name: '台南市',
                sub: []
            }, {
                name: '嘉义市',
                sub: []
            }]
        },{
            key: '四川省',
            val: [{
                name: '成都市',
                sub: ['都江堰市', '彭州市', '崇州市', '邛崃市', '金堂县', '双流县', '郫县', '大邑县', '蒲江县', '新津县']
            }, {
                name: '自贡市',
                sub: ['荣县', '富顺县']
            }, {
                name: '攀枝花市',
                sub: ['米易县', '盐边县']
            }, {
                name: '泸州市',
                sub: ['泸县', '合江县', '叙永县', '古蔺县']
            }, {
                name: '德阳市',
                sub: ['广汉市', '什邡市', '绵竹市', '罗江县', '中江县']
            }, {
                name: '绵阳市',
                sub: ['江油市', '三台县', '盐亭县', '梓潼县', '平武县', '北川羌族自治县']
            }, {
                name: '广元市',
                sub: ['旺苍县', '青川县', '剑阁县', '苍溪县']
            }, {
                name: '遂宁市',
                sub: ['蓬溪县', '射洪县', '大英县']
            }, {
                name: '内江市',
                sub: ['威远县', '资中县', '隆昌县']
            }, {
                name: '乐山市',
                sub: ['峨眉山市', '犍为县', '井研县', '夹江县', '沐川县', '峨边彝族自治县', '马边彝族自治县']
            }, {
                name: '南充市',
                sub: ['阆中市', '南部县', '营山县', '蓬安县', '仪陇县', '西充县']
            }, {
                name: '宜宾市',
                sub: ['宜宾县', '南溪县', '江安县', '长宁县', '高县', '珙县', '筠连县', '兴文县', '屏山县']
            }, {
                name: '广安市',
                sub: ['华蓥市', '岳池县', '武胜县', '邻水县']
            }, {
                name: '达州市',
                sub: ['万源市', '宣汉县', '开江县', '大竹县', '渠县']
            }, {
                name: '眉山市',
                sub: ['仁寿县', '彭山县', '洪雅县', '丹棱县', '青神县']
            }, {
                name: '雅安市',
                sub: ['名山县', '荥经县', '汉源县', '石棉县', '天全县', '芦山县', '宝兴县']
            }, {
                name: '巴中市',
                sub: ['通江县', '南江县', '平昌县']
            }, {
                name: '资阳市',
                sub: ['简阳市', '安岳县', '乐至县']
            }, {
                name: '凉山彝族自治州',
                sub: ['西昌市', '盐源县', '德昌县', '会理县', '会东县', '宁南县', '普格县', '布拖县', '金阳县', '昭觉县', '喜德县', '冕宁县', '越西县', '甘洛县', '美姑县', '雷波县', '木里自治县']
            }]
        },{
            key: '贵州省',
            val: [{
                name: '贵阳市',
                sub: ['清镇市', '开阳县', '息烽县', '修文县']
            }, {
                name: '六盘水市',
                sub: ['水城县', '盘县']
            }, {
                name: '遵义市',
                sub: ['赤水市', '仁怀市', '桐梓县', '绥阳县', '正安县', '凤冈县', '湄潭县', '余庆县', '习水县', '道真仡佬族苗族自治县', '务川仡佬族苗族自治县']
            }, {
                name: '安顺市',
                sub: ['平坝县普定县', '镇宁布依族苗族自治县', '关岭布依族苗族自治县', '紫云苗族布依族自治县']
            }, {
                name: '铜仁市',
                sub: ['江口县', '石阡县', '思南县', '德江县', '玉屏侗族自治县', '印江土家族苗族自治县', '沿河土家族自治县', '松桃苗族自治县']
            }, {
                name: '毕节市',
                sub: ['大方县', '黔西县', '金沙县', '织金县', '纳雍县', '赫章县', '威宁彝族回族苗族自治县']
            }, {
                name: '黔西南布依族苗族自治州',
                sub: ['兴义市', '兴仁县', '普安县', '晴隆县', '贞丰县', '望谟县', '册亨县', '安龙县']
            }, {
                name: '黔东南苗族侗族自治州',
                sub: ['凯里市', '黄平县', '施秉县', '三穗县', '镇远县', '岑巩县', '天柱县', '锦屏县', '剑河县', '台江县', '黎平县', '榕江县', '从江县', '雷山县', '麻江县', '丹寨县']
            }, {
                name: '黔南苗族布依族自治州',
                sub: ['都匀市', '福泉市', '荔波县', '贵定县', '瓮安县', '独山县', '平塘县', '罗甸县', '长顺县', '龙里县', '惠水县', '三都水族自治县']
            }]
        }, {
            key: '云南省',
            val: [{
                name: '昆明市',
                sub: ['安宁市', '呈贡县', '晋宁县', '富民县', '宜良县', '嵩明县', '石林彝族自治县', '禄劝彝族苗族自治县', '寻甸回族自治县']
            }, {
                name: '曲靖市',
                sub: ['宣威市', '马龙县', '陆良县', '师宗县', '罗平县', '富源县', '会泽县']
            }, {
                name: '玉溪市',
                sub: ['江川县', '澄江县', '通海县', '华宁县', '易门县', '峨山彝族自治县', '新平彝族傣族自治县', '元江哈尼族彝族傣族自治县']
            }, {
                name: '保山市',
                sub: ['施甸县', '腾冲县', '龙陵县', '昌宁县']
            }, {
                name: '昭通市',
                sub: ['鲁甸县', '巧家县', '盐津县', '大关县', '永善县', '绥江县', '镇雄县', '彝良县', '威信县', '水富县']
            }, {
                name: '丽江市',
                sub: ['永胜县', '华坪县', '玉龙纳西族自治县', '宁蒗彝族自治县']
            }, {
                name: '普洱市',
                sub: ['宁洱哈尼族彝族自治县', '墨江哈尼族自治县', '景东彝族自治县', '景谷彝族傣族自治县', '镇沅彝族哈尼族拉祜族自治县', '西盟佤族自治县', '江城哈尼族彝族自治县', '孟连傣族拉祜族佤族自治县', '澜沧拉祜族自治县']
            }, {
                name: '临沧市',
                sub: ['凤庆县', '云县', '永德县', '镇康县', '双江县', '耿马县', '沧源县']
            }, {
                name: '红河哈尼族彝族自治州',
                sub: ['蒙自县', '开远市', '个旧市', '绿春县', '建水县', '石屏县弥勒县', '红河县', '泸西县', '元阳县', '金平苗族瑶族傣族自治县', '河口瑶族自治县', '屏边苗族自治县']
            }, {
                name: '大理市',
                sub: ['祥云县', '宾川县', '弥渡县', '永平县', '云龙县', '洱源县', '剑川县', '鹤庆县', '漾濞彝族自治县', '南涧彝族自治县', '巍山彝族回族自治县']
            }, {
                name: '楚雄彝族自治州',
                sub: ['楚雄市', '双柏县', '牟定县', '南华县', '姚安县', '大姚县', '永仁县', '元谋县', '武定县', '禄丰县']
            }, {
                name: '西双版纳傣族自治州',
                sub: ['景洪市', '勐海县', '勐腊县']
            }, {
                name: '德宏傣族景颇族自治州',
                sub: ['潞西市', '瑞丽市', '梁河县', '盈江县', '陇川县']
            }, {
                name: '怒江傈僳族自治州',
                sub: ['泸水市', '福贡县', '贡山独龙族怒族自治县', '兰坪白族普米族自治县']
            }]
        },{
            key: '陕西省',
            val: [{
                name: '西安市',
                sub: ['高陵县', '户县', '周至县', '蓝田县']
            }, {
                name: '咸阳市',
                sub: ['武功县', '淳化县', '旬邑县', '长武县', '彬县', '永寿县', '礼泉县', '乾县', '泾阳县', '三原县', '兴平市']
            }, {
                name: '宝鸡市',
                sub: ['太白县', '凤县', '麟游县', '千阳县', '陇县', '眉县', '扶风县', '岐山县', '凤翔县']
            }, {
                name: '渭南市',
                sub: ['富平县', '白水县', '蒲城县', '澄城县', '合阳县', '大荔县', '潼关县', '韩城市', '华阴市', '华县']
            }, {
                name: '延安市',
                sub: ['黄陵县', '黄龙县', '宜川县', '洛川县', '富县', '甘泉县', '吴起县', '志丹县', '安塞县', '子长县', '延川县', '延长县']
            }, {
                name: '铜川市',
                sub: ['宜君县']
            }, {
                name: '汉中市',
                sub: ['佛坪县', '留坝县', '镇巴县', '略阳县', '宁强县', '勉县', '西乡县', '洋县', '城固县', '南郑县']
            }, {
                name: '榆林市',
                sub: ['子洲县', '清涧县', '吴堡县', '佳县', '米脂县', '绥德县', '定边县', '靖边县', '横山县', '府谷县', '神木县']
            }, {
                name: '安康市',
                sub: ['白河县', '旬阳县', '镇坪县', '平利县', '岚皋县', '紫阳县', '宁陕县', '石泉县', '汉阴县']
            }, {
                name: '商洛市',
                sub: ['柞水县', '镇安县', '山阳县', '商南县', '丹凤县', '洛南县']
            }]
        },{
            key: '甘肃省',
            val: [{
                name: '兰州市',
                sub: ['永登县', '皋兰县', '榆中县']
            },{
                name: '金昌市',
                sub: ['永昌县']
            }, {
                name: '白银市',
                sub: ['靖远县', '会宁县', '景泰县']
            }, {
                name: '天水市',
                sub: ['清水县', '秦安县', '甘谷县', '武山县', '张家川回族自治县']
            }, {
                name: '武威市',
                sub: ['民勤县', '古浪县', '天祝藏族自治县']
            }, {
                name: '张掖市',
                sub: ['民乐县', '临泽县', '高台县', '山丹县', '肃南裕固族自治县']
            }, {
                name: '平凉市',
                sub: ['泾川县', '灵台县', '崇信县', '华亭县', '庄浪县', '静宁县']
            }, {
                name: '酒泉市',
                sub: ['玉门市', '敦煌市', '金塔县', '瓜州县肃北蒙古族自治县', '阿克塞哈萨克族自治县']
            }, {
                name: '庆阳市',
                sub: ['庆城县', '环县', '华池县', '合水县', '正宁县', '镇原县']
            }, {
                name: '定西市',
                sub: ['通渭县', '陇西县', '渭源县', '临洮县', '漳县', '岷县']
            }, {
                name: '陇南市',
                sub: ['成县', '文县', '宕昌县', '康县', '西和县', '礼县', '徽县', '两当县']
            }, {
                name: '甘南藏族自治州',
                sub: ['合作市', '临潭县', '卓尼县', '舟曲县', '迭部县', '玛曲县', '碌曲县', '夏河县']
            }, {
                name: '临夏回族自治州',
                sub: ['临夏市', '临夏县', '康乐县', '永靖县', '广河县', '和政县', '东乡族自治县', '积石山保安族东乡族撒拉族自治县']
            }]
        },{
            key: '宁夏回族自治区',
            val: [{
                name: '银川市',
                sub: ['永宁县', '贺兰县', '灵武市']
            }, {
                name: '石嘴山市',
                sub: ['平罗县']
            }, {
                name: '吴忠市',
                sub: ['盐池县', '同心县', '青铜峡市']
            }, {
                name: '固原市',
                sub: ['西吉县', '隆德县', '泾源县', '彭阳县']
            }, {
                name: '中卫市',
                sub: ['中宁县', '海原县']
            }]
        },{
            key: '青海省',
            val: [{
                name: '西宁市',
                sub: ['湟中县', '湟源县', '大通回族土族自治县']
            }, {
                name: '海东地区',
                sub: ['平安县', '乐都县', '民和回族土族自治县', '互助土族自治县', '化隆回族自治县','循化撒拉族自治县']
            },{
                name: '海北藏族自治州',
                sub: ['海晏县', '祁连县', '刚察县', '门源回族自治县']
            },{
                name: '黄南藏族自治州',
                sub: ['同仁县', '尖扎县', '泽库县', '河南蒙古族自治县']
            },{
                name: '海南藏族自治州',
                sub: ['共和县', '同德县', '贵德县', '兴海县', '贵南县']
            },{
                name: '果洛藏族自治州',
                sub: ['玛沁县', '班玛县', '甘德县', '达日县', '久治县','玛多县']
            },{
                name: '玉树藏族自治州',
                sub: ['玉树县', '杂多县', '称多县', '治多县', '囊谦县','曲麻莱县']
            },{
                name: '海西蒙古族藏族自治州',
                sub: ['德令哈市', '格尔木市', '乌兰县', '都兰县', '天峻县']
            }]
        },{
            key: '西藏自治区',
            val: [{
                name: '拉萨市',
                sub: ['林周县', '当雄县', '尼木县', '曲水县', '堆龙德庆县', '达孜县', '工卡县']
            }, {
                name: '昌都市',
                sub: ['昌都县', '江达县', '贡觉县', '类乌齐县', '丁青县', '察雅县', '八宿县', '左贡县', '芒康县', '洛隆县', '边坝县']
            }, {
                name: '山南市',
                sub: ['扎囊县', '贡嘎县', '桑日县', '琼结县', '曲松县', '洛扎县', '加查县', '隆子县', '错那县', '浪卡子县', '措美县']
            },{
                name:'日喀则市',
                sub:['南木林县', '江孜县', '定日县', '萨迦县', '拉孜县', '昂仁县', '谢通门县', '白朗县', '仁布县', '康马县', '定结县', '仲巴县亚东县', '吉隆县', '聂拉木县', '萨嘎县', '岗巴县']
            },{
                name:'阿里地区',
                sub:['噶尔县','普兰县','札达县','日土县','革吉县','改则县','措勤县']
            },{
                name:'林芝地区',
                sub:['林芝县','工布江达县','米林县','墨脱县','波密县','察隅县','朗县']
            }]
        }
    ]

module.exports = locations
